import copy

month_date_names = {
    1: "первое",
    2: "второе",
    3: "третье",
    4: "четвертое",
    5: "пятое",
    6: "шестое",
    7: "седьмое",
    8: "восьмое",
    9: "девятое",
    10: "десятое",
    11: "одиннадцатое",
    12: "двенадцатое",
    13: "тринадцатое",
    14: "четырнадцатое",
    15: "пятнадцатое",
    16: "шестнадцатое",
    17: "семнадцатое",
    18: "восемнадцатое",
    19: "девятнадцатое",
    20: "двадцатое",
    21: "двадцать первое",
    22: "двадцать второе",
    23: "двадцать третье",
    24: "двадцать четверое",
    25: "двадцать пятое",
    26: "двадцать шестое",
    27: "двацать седьмое",
    28: "двадцать восьмое",
    29: "двадцать девятое",
    30: "тридцатое",
    31: "тридцать первое"
}

years_ending_names = {
    1: "первого",
    2: "второго",
    3: "третьего",
    4: "четвертого",
    5: "пятого",
    6: "шестого",
    7: "седьмого",
    8: "восьмого",
    9: "девятого",
    10: "десятого",
    11: "одиннадцатого",
    12: "двенадцатого",
    13: "тринадцатого",
    14: "четырнадцатого",
    15: "пятнадцатого",
    16: "шестнадцатого",
    17: "семнадцатого",
    18: "восемнадцатого",
    19: "девятнадцатого"
}

times_minute_names = {
    0: "ноль",
    1: "одна",
    2: "две",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",
    20: "двадцать",
    30: "тридцать",
    40: "сорок",
    50: "пятьдесят",
    60: "шестдесят",
}
for i in range(2, 6):
    for j in range(1, 10):
        times_minute_names[i*10+j] = f"{times_minute_names[i*10]} {times_minute_names[j]}"


times_hours_names = copy.copy(times_minute_names)
times_hours_names[1] = "один"
times_hours_names[2] = "два"
for i in range(2, 6):
    for j in range(1, 10):
        times_hours_names[i*10+j] = f"{times_hours_names[i*10]} {times_hours_names[j]}"

tens = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
for i in range(2, 10):
    for j in range(1, 10):
        years_ending_names[i*10 + j] = tens[i] + " " + years_ending_names[j]
years_ending_names[20] = "двадцатого"
years_ending_names[30] = "тридцатого"
years_ending_names[40] = "сорокового"
years_ending_names[50] = "пятидесятого"
years_ending_names[60] = "шестидесятого"
years_ending_names[70] = "семидесятого"
years_ending_names[80] = "восьмидесятого"
years_ending_names[90] = "девяностого"

months_names = {
    1: "января",
    2: "февраля",
    3: "марта",
    4: "апреля",
    5: "мая",
    6: "июня",
    7: "июля",
    8: "августа",
    9: "сентября",
    10: "октября",
    11: "ноября",
    12: "декабря"
}

hundreds_names = {
    1: "сто",
    2: "двести",
    3: "триста",
    4: "четыреста",
    5: "пятьсот",
    6: "шестьсот",
    7: "семьсот",
    8: "восемьсот",
    9: "девятьсот"
}

hundreds_names_standalone = {
    1: "сотого",
    2: "двухсотого",
    3: "трехсотого",
    4: "четрехсотого",
    5: "пятистого",
    6: "шестисотого",
    7: "семисотого",
    8: "восьмисотого",
    9: "девятисотого"
}